---
title: ExtElemChangeBeamSectionRegistry
classe: Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ExtElemChangeBeamSectionRegistry

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `extElemChangeBeamSectionRegistry.IsValidObject` | Boolean |
| `Void Dispose()` | `extElemChangeBeamSectionRegistry.Dispose()` | Void |
| `Void RegisterInterface(IExtElemChangeBeamSection)` | `ExtElemChangeBeamSectionRegistry.RegisterInterface(provider)` | Void |
| `Void Unregister()` | `ExtElemChangeBeamSectionRegistry.Unregister()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```